{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Lists implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of main frontend files and components.",
  "frontend/index.css": "Tailwind base and custom OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point with root div and script loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for Home, About, Courses, and Contact using SiteLayout.",
  "frontend/src/components/Footer.tsx": "Footer with branding, quick links, contact info, and caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, navigation links, and a mobile menu toggle.",
  "frontend/src/components/Section.tsx": "Reusable section wrapper providing spacing and container layout.",
  "frontend/src/components/SiteLayout.tsx": "Page layout combining Header, routed content, and Footer.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing authenticated or anonymous backend actors via React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing identity loading, login, and state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend query hooks.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, and base typography and layout styles.",
  "frontend/src/lib/utils.ts": "Provides a cn helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and loads global styles.",
  "frontend/src/pages/AboutTeacherPage.tsx": "Renders the teacher bio page with hero content, background info, and focus areas using cards and sections.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact page with contact info cards and a form that triggers a mailto link on submit.",
  "frontend/src/pages/CoursesPage.tsx": "Displays course offerings with icons, features, and CTA links, organized into cards and sections.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage hero, key offerings, and CTAs using responsive sections and UI cards.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, OKLCH variables, and plugin integrations.",
  "project_state.json": "Project metadata describing requirements for a simple educational website for Manthan Academy, including features, pages, and image needs. Contains versioning, feature list, and project summary details."
}